{"podcast_details": {"podcast_title": "Star Wars Minute", "episode_title": "Rise of Skywalker Minute 90: Poe Knows w/ Tony Thaxton", "episode_image": "https://content.production.cdn.art19.com/images/b8/61/c9/a3/b861c9a3-80ad-48e5-9486-a757b7df9c0d/afa363f1934b58926644ef63980a903d82887910cad28571b29728ae85c331a1ddecf0f6f295c2f89541d6c808913497e14ad511ec1a3cc0f066db4901ab1895.jpeg", "episode_transcript": " Hello, welcome back to Star Wars Minute. It's the daily podcast where we analyze, scrutinize, and this minute has three guys. The Star Wars movies, one minute at a time. I'm Pete the Retailer from petetheretailer.com. I'm Alex Robinson from alexrobbinson.fun. And I'm Tony Thaxton from bazaaralbums.com. Thanks for coming back again, Tony. Thank you. Were the three guys us? Was it? Or was it Lando and Poe and Finn? Well, those guys are not the top stars. It's true. But yes, we get this movie, this minute, this movie, this minute, minute 90 of Star Wars Episode 9, Rise of the Skywalker. It starts out with Poe having a talk with Leia's corpse, and it ends with Poe and Finn having to talk to each other. So but hey, guess what? Like Lando's back and he was just kind of walking right into the room while somebody, you know, Poe's having a heart to heart, well, heart to heart. Having a cup like he was kind of like looking for inspiration slash encouragement from the spirit of Princess General Leia basically. Yeah, he's kind of talking out loud to a dead body. And Lando's like, hey, you know what? It's like a little bit rude, I think, just to walk in there and unannounced and be, I get what he's going for and it works, but it's also a little bit like. He's like, I was just standing here in the shadows. What's wrong with that? What's so creepy about that? Yeah, I mean, glad to see Lando's back. And you know, we didn't get the follow up stuff of what he did to get here. Remember that when we last saw him in his ice cream truck, then they were like, hey, come with us. And he was like, nah, I'm done here. I'm not, I'm not, you know, my rebellion, my flying days are over. But then the Knights of Ren were desecrating the Millennium Falcon. He was like, oh, my ship. He's like, if those guys are that evil, we have to fight them. And then he had a change of heart and also was like, I got to go talk to Leia. And then he, I believe they say that he also just arrived too late to talk to Leia. I think that he's just getting there too, basically. It wasn't like he was there for a while. Was he trying to get here to talk to Leia? That was part of it. Or was he just coming to help the resistance? Both, I think. Okay. Because remember that was like, he was like, oh, send Leia my love. And Ray was like, tell yourself. That's exactly how it was. If he interprets that as they're not going to tell, they're not going to send Leia my love. I have to go in person if I want to give her my love. These kids, they just don't get it. We are positive on that timing though. Like he couldn't, he wasn't coming there because he had gotten word about Leia. No, I don't think so. Okay. I think he had already had a change of heart and decided to go help out or at least talk to Leia about it. And this is the first we see him since that initial scene, you said? Yes. Right? Yes. So this is the unveiling of him in the young Lando clothes still. Yes. Right. I think it's, I mean, obviously it's like, oh, it's a callback to that movie. I think it's weird though in universe. It's really weird that Lando would show up wearing clothes he was wearing 40 years ago. Yeah. You know what I mean? Was he, did he keep, is this literally the same shirt? Did he get multiple copies of it over the years? These all of these. Did he have to let it out when he was getting older? Everything you are asking in your head right now is what I was asking myself the first time I saw the image of him in these clothes. Because I both love it and hate it at the same time. It's like he's showing up in like a zoot suit. They're like, why are you wearing that? Why are you wearing those old clothes from, are you dragging into a costume party or something? Or you know, he's seen all these people that are way younger than him. He's like, oh, they've never seen this outfit before. Right. Maybe it's come back around. It's like hip retro now. Right. Oh yeah. Or he thinks it is anyway. Right. He went and bought it at the vintage store on display. Right. I used to have an outfit just like that. Well, in the book, in the Star Wars Rise of Skywalker expanded edition of a New York Times bestselling author Ray Carson, it says, the former rebellion general had flown to Agent Claus on his ship, the Lady Luck. So points for the Lady Luck. That's from the Lando Calrissian Adventures. Yeah. Like that's his EU ship, I think. Almost always as far as I'm concerned. Flown to Agent Claus on his ship, the Lady Luck, almost as soon as they had left Pasana. Something Ray had said convinced him and Poe was so glad he was here. Then he says, he says his line, but then according to Connick's Lando had been overcome with grief when he arrived just a little too late. He'd missed his chance to say goodbye. So he did. He left. Even though he left right after, around the same time they left, they stopped and had a Kefbeer adventure and he got there around the same time. Or maybe there's a little bit of time in between Leia, Leia's passing and Poe arriving. Yeah, he drives slower. And they're driving the Falcon, so they can go a lot faster than... Don't knock the Lady Luck out. It's the fastest hunk of junk in the galaxy out here. Hunk of gunk. I'm not knocking the Lady Luck out, it's no Falcon, that's all I'm saying. I think Lando would agree on that. You think Lando's like, great, I get the Falcon now that I'm here. Does Chewie come with it? Speaking of Chewie, I did want to get Lando's back. He says, hey, what you did, I'm not ready. Neither were we. And he says, Luke, Han, Leia, me, who's ever ready? And that would be a good point to just in the background drop in a Chewbacca roar. Luke, Han, Leia, me. Totally forgotten about Chewbacca again. It is funny. I don't know why, but it seems funny to me that he includes himself as part of the gang. When I guess I still don't think of him that way. You know what I mean? That's because I feel like this has come up before, but for younger people who grew up watching these movies straight through, okay, fine, Lando betrayed them in the next movie, he's back good again. But for people who lived through it in real time, there was three years where Lando was like the bad guy. So to me, it's going to be tougher for me to forgive that initial portrayal of the gang, even though I know he was kind of put in an awful situation. I get that, but I still don't think of him as like they had three years of adventures before Lando showed up as enjoined. Right. So I, you know, I not only the three years between the movies, but also, you know, I grew up with, remember the home video situation was weird with you. So and I had the bootleg, I had Star Wars and Empire and I didn't have Jedi. So it wasn't until like 10 years after, basically almost, no, maybe not that much. Ten years after the 10th anniversary one. So the first time I think that like I had Return of the Jedi. So like 87. So let's call it more like, you know, seven years of only having seen Return of the Jedi in the theaters once or twice and then, you know, reading the storybook, obviously and stuff like that. But like Lando wasn't ensconced in the team the way that it might've been for some others and people coming around now. So I had more time to stew on it, but I've grown, I've turned on him. I've turned on him. How about that? I like him now. But he is, yes, it's kind of like, you know, Peter Lofford. It's like if Ringo was the last surviving Beatle. He's like, yeah, sure. When I recorded Sergeant Pepper, we did the thing, you know, like him now as the authority. He's the only survivor. I was going to say like Marky Ramon. He's like Marky Ramon now because all the other, like the original Ramons are all dead. And he's like, yeah, when I was, remember with the Ramon, it's when we were, and he's like, yes, he is definitely an important Ramon of record, but he's not an original and also. Right. Yeah, there you go. That's a better analogy. Yeah. Yeah. That is, that is interesting that I never thought, cause I am a little bit younger than you guys and yeah, I always did kind of, I know he's, you know, on the outside a little bit, but I, yeah, I did always kind of lump him in with everyone else. Like I definitely was, where's Lando when the, when they started making these newer movies. And I still think it's a little weird that it took till the third one. It is definitely weird. Like there's no reason Maz Kanata should not have been Lando Calrissian. Yes. Or the master code breaker. There are reasons, but yeah, the master code breaker. Yeah. There were lots of opportunities to be like, well. Yeah. For the record, I, if you're going to break the original gang down into Beatles, Lucas Paul, Han is George, Leia is John and Lando is Ringo. I think that might be dead on. I don't think I can argue that. I'm processing it. Okay. I'm processing. So, oh yeah. So, so I, he, he's telling Poe, you know, Oh, we had each other. That's how we got through this. We had each other. That's why we won. Our boss was a fish. Can you believe it? Empire overthrown by teddy bears and a talking fish. Crazy. I was all, what have we here? That's what, I want to hear Lando putting their adventures into more mundane terms like that. Right. You know, anyway, talking fish. I remember when I met Han Solo, me and my robot girlfriend were, I got to get to the Falcon immediately. Dio, Dio is back. Dio is back. What is he doing with that toolbox? As literally my note, what is Dio doing? Is it just like a little kid who's just kind of like, you know, just likes, Oh, I'm being, I'm pretending to use a toolbox and just, you know, moving tools around and stuff. Yeah. I don't know. How do you feel about Dio, Tony? I think Dio is a little bit of a swing and a miss. I don't, I don't despise it, but it definitely, it definitely. I don't despise it. I don't hate it with every fiber of my being. Well I don't, it's okay. But I don't know. It just felt very, Hey, everybody likes BB-8. We got to like try to make a new one of those. And it just feels a little too that. And it's, and I feel like nobody really cared too much. Yeah. Yeah. Well, definitely feels like the cousin Oliver. Yeah. Yes. Yes. That's not a data reference, right? No. We got to update that. What's a new, what's a more modern version? Who is someone our friends that came in towards the end that they were trying to? Let's go with the more modern version from 30 years ago. Well, people still watch friends. No one watches. Yeah. Anyway, I think the great Gazoo, right? When he came in on friends. Yeah, totally. Yeah. That's what, that's what Kylo Ren should be like the great Gazoo, where he pops up as a ghost, helps them out and then calls them dumb dumb and leaves. Oh, Harvey Korman. The so in, they don't explain why I'm going back to the novelization again. I'm not going to full title. The term at the one by Rachel Carson. Ray Carson. Yes. Ray Carson. New York Times bestselling author. That's the one. But they don't really say what Dio's doing. The tiny droid that rescued from Ochi ship, toddled toward him and began poking around Ray's things. Doesn't say why, doesn't say what. But then it says he noticed Ray's half built lightsaber and inclined his pointy nose cone towards it. And that's when Finn is like, Hey, don't touch that. That's my friends. But like, that is interesting because it's you know, Dio, if Dio was, if Ochi was a sith hunter or whatever, and was like helping to hunt down the Jedi, right? That was the, it was kind of part of that. Sure. Right? Because isn't there a whole thing in the comics with Ochi who's helping out Darth Vader to find the, I don't know, I could be, I could be conflating some things, but it makes a little more sense if this sith hunters droid was like, Hey, look, a lightsaber versus just like droid is just pecking at a toolbox for no reason. Yeah, I agree. I can you see the, I couldn't see anything that looked like a lightsaber in that pile of junk. I saw her cool little blaster thing, her kind of retro style blaster spilled out, but I didn't see lightsaber. I could be wrong. So are these tools, where did Rey get these tools since joining the resistance? I think when she signed up for Apex tech, she got to keep the tools after. Okay. So that's, she got it from the, cause Finn seems pretty like proprietary about it. Like those are specifically Rey's tools, not just general resistance tools that's free for anyone to use. It's like. Which makes me think maybe it makes more sense if it is, Hey, these are like, she's building a lightsaber. Those are her lightsaber tools. Those are a Jedi tools. So, but we don't, I don't think we see that Tony, are you scrubbing through it right now? No. Oh, okay. I saw that like producer look on your face where I thought you were looking something up. Maybe not. But yeah, I don't think we see it actually in the toolbox. So who knows? Yeah. I didn't even realize that. What lightsaber though? Is it, this is a completely new lightsaber? It's the one we see her with at the end. Right. Oh, okay. That one she's been working on. There's a couple of scenes, a couple of things in the book where it's mentioned is that she's been like repairing Anakin's lightsaber helped her get like hands on experience with the lightsaber repair and construction. And so then she's applying that to her own lightsaber and talks about her, like the dark rays lightsaber, the one that kind of folds into, folds into that when she has that vision in the book, it says like, oh, hey, like this, this evil vision of me had the lightsaber that I'd sketched out recently. Like this, this lightsaber concept that I had been working on in this evil version of me has it. So we hear that she's been kind of working on that. Got it. So does that make her then scrap it and make new, come up with a new design? Maybe I don't know. Or maybe Dio breaks it here. She's working on that. She's like, what's this? Smack, smack, smack. Like breaks the lightsaber that she's been working on. What do we think is the fate of Dio? Like does he still get to hang around with the gang? Is he like part of them or is he just kind of like, all right, Dio, you know. It's just dropping back off on Pizana. Yeah. Like, and what are the rules about that? Can you just let a droid go? And it's just like, all right, hot scramble. You know? I don't know. I think we'll see him again. I feel like I have a feeling we'll be seeing a little Dio again in the future. I feel like Rey is the only one really who has like affection for him, who would like take him in or whatever. Well, yeah, there you go. That might be the connection. Po already has, he already has BB-8. He doesn't need another droid. Yeah. Finn's too obsessed with Rey. Once any sort of character is introduced, I feel like once there's more, we're going to see them again at some point. I feel like unless it's Rose. I don't mean that as an insult on her. What did you say? I said Jar Jar, but Rose is a better example. Yeah. And that's not anti-Rose. That's just, I just feel like, you know, they put her in this kind of, but not really. I would absolutely watch the Rose and Jar Jar show. Star Wars Troll Hour starring Rose and Jar Jar. Rose and Jar Jar. And Arkarni as the junk dealer. Yeah. There's, interesting that they don't know Dio's name until now. He didn't say his name was Dio before? He did to some people. I don't know. Did he? Cause here Finn is Finn who was there in the room when they, when they did with Rey at least. I think I was going to say Rey or even R2. Yeah, well I'm sure he and R2. I'm not R2, sorry. I meant BB8. I'm sure they're having all kinds of conversations. Yeah plotting. Yeah. Now I want to go back to see what, I feel like Rey is the one who said it. That he said, my name is Dio. I don't know if he does. Well anyway. You think it's like Ewok? It's one of those words that's never spoken in the movie and yet we all know and love Dio. I know cause, cause didn't Poe say like Dio. Poe calls him Conehead here. Conehead. Coneface I think. Tip of the hat to the SNL franchise. Maybe that was cause he didn't know his name. Shout out. Well, all right. Nobody asked. I can't find it, but I'm assuming that we don't hear his name and nobody asked before. And this is the first time that. Everybody correct me if I'm wrong. You're going to do that anyway. It's okay. I expect that. I wanted to comment on the rebel base here for a second. I think it's, it's, it's funny and weird that they are camped out underneath the TNT4. I guess in some kind of giant cave or something. Is that what they're supposed to be? They're not just exposed to the elements. They're in like a, a giant like the TNT4 is parked in a cave and they're all kind of hanging out underneath it. And I think it's funny cause why don't they hang out in it? Why bring all the computers out into the wet damp cave rather than just use the computers that are on the TNT4? Or it's nice and dry and climate controlled and so on. Anyway, I just think it's a kind of a funny, uh, and I'm also kind of disappointed we never get to see the inside of the TNT4, which is the part that we all know and love, you know, the famous white hallways. But anyway, I'm glad to see it again, at least the TNT. I mean, it is. Um, yes, I keep forgetting that it's there and that is that. So yes, it's at least bookend though, cause that's the first ship we saw in star wars. I guess it's not the last ship we see, but it is in the last. And it does say, I know as, as we last see it. Yeah. Right. That's right. It's catchphrase. I'm really surprised we never saw the escape pods again. That seems like it would have been a good callback escape pods from the TNT4. Yeah. Or, or some, uh, mention of it, but, um, yeah, or like there's a handful of things. There's a handful of things that they haven't gone back and dredged back from, from the early movies that can easily put in there. Snow speeders, uh, yeah, snow speeders, escape pods, give it time. Yeah. I guess those are the only two things I think everything, everything else on the list is checked off. Yeah. So really hard to think of too much. Wado not, cause Wado never came. Although I guess he came back in, in, uh, attack of the clones. So he did come back at least once. Right. So was he ever in clone wars? I don't remember those well enough at all. I know the, his race was, I know, but I don't know if he was, they go to meet the king of the toy Darien's or is that what he is a toy Darien? Yeah, I believe so. This is where toy right in it. I know you hate it when we talk about the toy Darien's. Um, well that overall was, uh, everything that I had for this minute. Um, one less, I one last thing. Yes. I was about to ask anybody else. When Poe is, uh, is talking at Leia's, um, bedside, it's not grave side really. No, we all know Poe presumably thinks is aware that there are such things as force ghosts and that when Luke showed up in, in, uh, on that salt planet, which is called Crate, uh, Poe knows that that was an illusion, right? I've assumed it was, he was informed that, oh yeah, that was, Luke is actually dead and he came in here and did all this stuff. And so when he's talking to Leia, is he kind of hoping that she's going to kind of show up as a force ghost and say, okay, this is what you do, Poe, you know, go this kind of stuff. That's why he's like, Hey, I don't know how to do this. And you said I was ready. So, um, you know, the keys to the tan TV for, you know, where they, that sort of thing. Anyway, he must've been disappointed when she didn't, uh, when Lando shows up and says, okay, I mean that, you think you poked Lando to see like, are you real? Oh no, I'm not dead. It's also weird that Lando shows up almost in the same type of mood as Han Solo showing up to talk to, uh, Kylo Ren. You know what I mean? It's like, Oh look, here's an original, it's one week we're due for another original trilogy character to show up with a rousing speech about how he should, uh, keep fighting. Do we think that this was a supposed to be a Poe and Leia moment after like, like does he show up? Does she show up to him as a force ghost in the original iteration of this? Hmm. I wonder. It's a weird arc for this, like almost like a mini mini arc where Poe's like, I don't know what to do. And then Poe and then Lando's like, you should hang out with your friends more. And then the next scene he's like, yes, we should be friends now. It's almost like a little, a little journey that Poe goes on in this one little scene lit. Um, that's all I have for minute number 90. All right, Tony, anything else from this minute or just from the movie in general? Anything you want us to look out for anything you said you missed? Uh, no, not really. Uh, yeah, I didn't have anything else for this minute. And I think I've kind of said my main thoughts on this movie. Like I see, I, uh, I don't know. People get a little bent out of shape on this movie. I understand we have some hardcore Star Wars fans. I consider myself one, but again, I just want to have fun. Like I'm not going to let it ruin my life if I didn't like something about the movie. Um, yeah, I, uh, I'm okay with, uh, what we find out about Ray. I don't love it. I don't hate it. Um, but it was kind of where my brain went the first time I even, I think before I even saw the force awakens. Um, so it kind of seemed like the obvious thing that was coming. But then I didn't really think they were going to go. You thought her last name was Skywalker even before, even before force awakens? I mean, yes, didn't we all, uh, but no, I, I, yeah, I don't know. I know I'm getting, or no, am I, I guess, no, this fate has been, we do know this at this point in the movie. So you guys have talked about this, I'm sure. Yes. Well, I don't, I, I'm still not 100% convinced because as we know, we hear it from, from, you know, unreliable sources who have an interest in this being the case. Right. And it's been people, people thinking that's the idea. Right. But. All right. I guess that's minute number 90. Yeah. There we go. In a nutshell. Um, but, uh, you just said something that made me think of something else and now I can't think of it. Anyway, nevermind. Unimportant. I'll think of it after you're done. And then I'll be like, I should have told Tony that. All right. I'm sorry. I said Poe knows. And all I could think of was Poe knows baseball, Poe knows basketball, Poe don't know. Did we did, um, you, you're somebody who likes a good toy. Uh, do you have anything, do you have any merchandise, any toys or anything from this movie from this movie? Uh, you know, funny enough, I don't think I do from this movie, but, uh, my girlfriend does. And I feel like it's worth grabbing real quick. Okay. If you don't mind. Sure. Pete, why don't you do the plugs while Tony's getting his product. All right. Well, um, while you while Tony's getting that, let's talk about, uh, our weekend show. If you're going to miss us over the weekend, why not go to starwarsminute.com slash Patreon and sign up over there. We do shows on Saturdays. We review things. We do shows on Sundays. We just talk about all kinds of nonsense. And, uh, you can even get a free trial of that, uh, uh, seven day free trial. Go check it out. If you like it, sign up, continue with it. If you don't, that's okay. You can bail. You can wedge that stuff and, uh, we'll, we'll, uh, we'll still, we'll still like you. Oh, look at this now. Now Tony is holding a life-size Babu Frick. Yeah. Uh, I think these were only available at Disneyland and probably Disney world, but, uh, it's very, it's very well done, uh, this Babu Frick toy and, uh, it also articulated, uh, he does. Wait, I can't remember how to. Whoa. Whoa. Yeah. Those of you not watching the video, he moves and talks. Yeah. And the face is like rubbery. So it looks pretty good. It does. They said the, the mechanism of the neck is the loudest thing. It's, it's louder than the actual talking. I'm Babu Frick. I know how he feels. So anyway, yeah. Like everyone else, I feel like we, we both loved the old Babu Frick and, uh, yeah, saw that and she felt she needed to get it. Yeah. Sure. Well, uh, that's it. Sorry. No, thanks. Thanks Tony for, for introducing us to that Babu Frick. Um, and, uh, thanks for being with us all week. Uh, and giving us your opinions on stuff, hanging out. Thanks for your years of service, uh, to the show. Thanks for keeping my streak alive. We will, um, no doubt, uh, be in touch with the future endeavors for future and a good luck on future endeavors. Sounds like we're firing you, but we're not. We're saying, well, when we do stuff in the, in the future, we'll definitely, uh, we'll keep your application on file. Exactly. That's fair. We're not going to transmit it to the academy in this year. Um, but, uh, everybody else, uh, we will hope to see you and hear you, uh, on Monday for a brand new episode of Star Wars Minute. Star Wars Minute. Babu, Babu, Babu, Babu, Babu Frick."}, "podcast_summary": "Welcome back to Star Wars Minute. In this podcast episode, the hosts analyze minute 90 of Star Wars Episode IX, Rise of the Skywalker. The minute begins with Poe having a heartfelt conversation with Leia's corpse and ends with Poe and Finn talking to each other. Lando unexpectedly enters the room and remarks on Poe's behavior, leading to a discussion about Lando's appearance and fashion choices. The hosts speculate on Lando's motives and timing for joining the Resistance. They also question Dio's presence and his fascination with Rey's tools. The hosts touch on the significance of Lando including himself as part of the gang and the lack of screen time for Chewbacca. Overall, the hosts express their enjoyment of the movie and their acceptance of the revelations about Rey's character. The episode ends with Tony sharing a life-size Babu Frick toy he acquired from Disneyland.", "podcast_guest_summary": "Motion City Soundtrack is an American rock band formed in Minneapolis, Minnesota in 1997. The band's line-up consists of vocalist and guitarist Justin Courtney Pierre, lead guitarist Joshua Cain, keyboardist Jesse Johnson, bassist Matthew Taylor, and drummer Tony Thaxton. Over the course of their career, the group has toured heavily and released six studio albums, the majority on independent label Epitaph Records. The band's sound, usually described as pop-punk and/or emo, makes notable use of the Moog synthesizer. Pierre mainly handles the band's lyrics, which often touch on themes of anxiety, alienation, relationships, and self-destructive behavior.\nThe band was founded by Cain and Pierre, and took several years to form a stable lineup. I Am the Movie, the group's debut album, was released in 2003. Their commercial breakthrough, Commit This to Memory, arrived in 2005, and its follow-up Even If It Kills Me (2007) was similarly successful. For many years, the band was a staple of the Warped Tour. They briefly signed to major label Columbia for My Dinosaur Life (2010), but rejoined Epitaph for Go in 2012. Their most recent effort, Panic Stations, was released in 2015. The group disbanded the following year, but they announced a reunion in 2019.", "podcast_guest_extra_summary": "Motion City Soundtrack is an American rock band formed in Minneapolis, Minnesota in 1997. The band's line-up consists of vocalist and guitarist Justin Courtney Pierre, lead guitarist Joshua Cain, keyboardist Jesse Johnson, bassist Matthew Taylor, and drummer Tony Thaxton. Over the course of their career, the group has toured heavily and released six studio albums, the majority on independent label Epitaph Records. The band's sound, usually described as pop-punk and/or emo, makes notable use of the Moog synthesizer. Pierre mainly handles the band's lyrics, which often touch on themes of anxiety, alienation, relationships, and self-destructive behavior.", "podcast_highlights": "Thank you, Tony, for joining us and sharing your thoughts. It was great having you on the show. Best of luck with all your future endeavors.", "podcast_highlights_topics": ["Thank you", " Tony", " for joining us this week. We really appreciate your insights and contributions to the conversation. Have a great weekend", " and we'll see you all on Monday for a brand new episode of Star Wars Minute. May the Force be with you."]}